app/workers/hard_worker.rb

INSERT INTO "gas_prices" ("gas_price", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["gas_price", 231.5], ["created_at", "2021-04-15 04:51:28.493580"], ["updated_at", "2021-04-15 04:51:28.493580"]]
---
  def perform()
  #  get gas price
    @response = HTTParty.get( Rails.application.credentials.api[:gas_api])
    @gas_price = Hash['gas_price' => @response['fast']]

    # keeps the number of prices saved in the database at one
    @gas_prices = GasPrice.all
    if @gas_prices.length != 0
       @gas_prices[0].update_attribute(:gas_price, @gas_price['gas_price'])
    else
      # saves the most recent pull from api to GasPrice table.
      @gas = GasPrice.new(@gas_price)
      if @gas.save