app/views/user_mailer/send_notification_mail.html.erb

<p>
<%=Price.first.price%>
</p>
<p><%=GasPrice.first.gas_price%></p>
---
SELECT "prices".* FROM "prices" ORDER BY "prices"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "gas_prices".* FROM "gas_prices" ORDER BY "gas_prices"."id" ASC LIMIT $1  [["LIMIT", 1]]