app/controllers/gas_prices_controller.rb

SELECT "gas_prices".* FROM "gas_prices"
---
  def index
    @gas_prices = GasPrice.all

INSERT INTO "gas_prices" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-04-13 22:55:13.373151"], ["updated_at", "2021-04-13 22:55:13.373151"]]
---
  def search
    @gas = find_price()
    @price = Hash['gas_price' => @gas]
    @gas_price = GasPrice.new(@gas = Hash.new)

    if @gas_price.save