app/controllers/prices_controller.rb

SELECT "prices".* FROM "prices"
---
  def index
    @prices = Price.all

SELECT "prices".* FROM "prices" WHERE "prices"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_price
      @price = Price.find(params[:id])